Repository: macadmins/nudge
Catalog: *.lproj/Localizable.strings
Languages: da, de, fr, ja, ko, ru, sv, zh

source: Additional Device Information
da: Supplerende information om Mac'en
de: Weitere Geräteinformationen
fr: Informations supplémentaires sur l'appareil
ja: デバイスの追加情報
ko: 기기의 추가 정보
ru: Информация об устройстве
sv: Utökad information
zh: 额外设备信息

source: Username:
da: Brugernavn:
de: Benutzername:
fr: Nom d'utilisateur :
ja: ユーザー名:
ko: 사용자이름:
ru: Имя пользователя:
sv: Användarnamn:
zh: 用户名:

source: Serial Number:
da: Serienummer:
de: Seriennummer:
fr: Numéro de série :
ja: シリアルナンバー:
ko: 시리얼넘버:
ru: Серийный номер:
sv: Serienummer:
zh: 序列号:

source: Architecture:
da: Arkitektur:
de: Architektur:
ja: アーキテクチャ:
ko: 아키텍쳐:
ru: Архитектура:
sv: Arkitektur:
zh: 架构:

source: Version:
ja: バージョン:
ko: 버전:
ru: Версия:
zh: 版本:

source: Language:
da: Sprog:
de: Sprache:
fr: Langue :
ja: 言語:
ko: 언어:
ru: Язык:
sv: Språk:
zh: 语言:

source: Current OS Version:
da: Nuværende OS-version:
de: Aktuelle Betriebssystemversion:
fr: Version actuelle du système d'exploitation :
ja: 現在のOSのバージョン:
ko: 운영체제의 현재 버전:
ru: Текущая версия macOS:
sv: Nuvarande OS-version:
zh: 当前系统版本:

source: Required OS Version:
da: Påkrævet OS-version:
de: Erforderliche Betriebssystemversion:
fr: Version du système d'exploitation requise :
ja: 必要とされるOSのバージョン:
ko: 운영체제의 필수 버전:
ru: Требуемая версия:
sv: Krävd OS-version:
zh: 需要的系统版本:

source: Days Remaining To Update:
da: Dage at opdatere i:
de: Verbleibende Tage bis zur Aktualisierung:
fr: Jours restants :
ja: 更新までの残り日数:
ko: 업데이트까지 남은 일수:
ru: Осталось дней:
sv: Kvarstående dagar:
zh: 剩余天数更新:

source: Hours Remaining To Update:
da: Timer at opdatere i:
fr: Heures restants :
ja: 更新までの残り時間:
ko: 업데이트까지 남은 시간:
ru: Осталось Часов:
sv: Kvarstående timmar:
zh: 剩餘時間更新:

source: Deferred Count:
da: Antal udsættelser:
de: Anzahl Aufschübe:
fr: Décompte différé :
ja: 延期した回数:
ko: 지연된 횟수:
ru: Откладывали раз:
sv: Uppskjuten antal gånger:
zh: 已推迟次数:

source: More Info
da: Mere information
de: Mehr Informationen
fr: Plus d'informations
ja: 詳細情報
ko: 자세한 정보
ru: Информация
sv: Mer information
zh: 更多信息

source: Click to close
da: Klik for at lukke
de: Zum Beenden hier klicken
fr: Cliquez pour fermer
ja: クリックして閉じる
ko: 클릭하여 닫기
ru: Нажмите, чтобы закрыть
sv: Klicka för att stänga
zh: 点击以关闭

source: Click for additional device information
da: Klik for at få mere information om Mac'en
de: Hier klicken, um weitere Geräteinformationen anzuzeigen
fr: Cliquez pour obtenir des informations supplémentaires sur l'appareil
ja: クリックしてデバイスの追加情報を確認
ko: 클릭하여 기기의 추가 정보 보기
ru: Нажмите для информации об устройстве
sv: Klicka för mer information
zh: 点击以获取更多设备信息

source: Click to zoom into screenshot
da: Klik for at forstørre skærmbilledet
de: Hier klicken, um den Screenshot zu vergrößern
fr: Cliquez pour agrandir la capture d'écran
ja: クリックしスクリーンショットを拡大
ko: 클릭하여 스크린샷 확대
ru: Нажмите для увеличения скриншота
sv: Klicka för att zooma in
zh: 点击放大截图

source: Click for more information about the security update
da: Klik for mere information om sikkerhedsopdateringen
de: Hier klicken, um mehr Informationen über das Sicherheitsupdate zu erhalten
fr: Cliquez pour plus d'informations sur la mise à jour de sécurité
ja: クリックしてセキュリティ更新の詳細情報を確認
ko: 클릭하여 보안 업데이트의 자세한 정보 보기
ru: Нажмите для дополнительной информации об обновлении безопасности
sv: Klicka för mer information om säkerhetsuppdateringen
zh: 点击以获取关于安全更新的更多信息

source: Update Device
da: Opdater Mac
de: Gerät Aktualisieren
fr: Mettre à jour l'appareil
ja: デバイスの更新
ko: 기기 업데이트
ru: Установить
sv: Uppdatera
zh: 更新设备

source: Your device will restart during this update
da: Din Mac vil genstarte under opdateringen
de: Ihr Gerät wird während dieses Updates neu gestartet
fr: Votre appareil redémarrera pendant cette mise à jour
ja: デバイスは更新中に再起動します
ko: 업데이트 도중에 귀하의 기기는 재시작 될 것입니다
ru: Ваше устройство перезагрузится во время обновления
sv: Din dator kommer att startas om under uppdateringen
zh: 在更新过程中，你的Mac将会重新启动。

source: Important Notes
da: Vigtig information
de: Wichtige Hinweise
fr: Informations importantes
ja: 重要
ko: 중요 사항
ru: Важные примечания
sv: Viktig information
zh: 重要信息

source: Updates can take around 30 minutes to complete
da: Opdateringer kan tage op til 30 minutter at gennemføre.
de: Die Aktualisierung kann etwa 30 Minuten in Anspruch nehmen
fr: Les mises à jour prennent environ 30 minutes pour s'effectuer
ja: 更新の完了には約30分かかります
ko: 업데이트가 완료되기까지 30분 정도 소요 될 예정입니다
ru: Обновления обычно занимают примерно 30 минут
sv: Uppdateringar kan ta ca 30 minuter
zh: 这大约会花费30分钟。

source: A fully up-to-date device is required to ensure that IT can accurately protect your device. If you do not update your device, you may lose access to some items necessary for your day-to-day tasks. To begin the update, simply click on the Update Device button and follow the provided steps.
da: En fuldt opdateret Mac er påkrævet for at IT afdelingen kan beskytte dine data. Hvis du ikke opdaterer din Mac, kan du risikere at miste adgang til muligheder, som er nødvendige i dagligdagen. For at påbegynde opdateringen skal du klikke på "Opdater Mac"-knappen og følge instruktionerne på skærmen.
de: Ein vollständig aktualisiertes Gerät ist erforderlich, um sicherzustellen, dass die IT-Abteilung Ihr Gerät effektiv schützen kann. Wenn Sie Ihr Gerät nicht aktualisieren, verlieren Sie möglicherweise den Zugriff auf einige Werkzeuge, die Sie für Ihre täglichen Aufgaben benötigen. Um das Update zu starten, klicken Sie auf die Schaltfläche Gerät aktualisieren und befolgen Sie die angegebenen Schritte.
fr: Un système entièrement à jour est nécessaire pour garantir que le service informatique puisse protéger votre appareil efficacement. Si vous ne mettez pas à jour votre appareil, vous risquez de perdre l'accès à certains outils nécessaires à vos tâches quotidiennes. Pour commencer la mise à jour, cliquez simplement sur le bouton Mettre à jour l'appareil et suivez les étapes fournies.
ja: ITが正確にあなたのデバイスを保護するためには、デバイスを完全に最新にすることが必要です。 デバイスを更新しない場合、日々のタスクに必要なアイテムへのアクセスができなくなる可能性があります。 更新を開始するにはデバイスの更新ボタンをクリックし、指示されたステップに従ってください。
ko: IT 팀이 귀하의 기기를 정밀하게 보호하기 위하여 최신 업데이트가 기기에 항시 탑재될 것을 요청드립니다. 귀하께서 기기를 업데이트 하지 않는다면, 일상의 업무에 필요한 아이템들의 접근 권한이 상실될 수 있습니다. 기기를 업데이트 하시려면, 기기 업데이트 버튼을 클릭하시고 제공되는 안내를 따르시면 됩니다.
ru: Обновления нужны, чтобы IT-команда могла защитить Mac и данные. Если вы не обновите устройство, есть риск потерять доступ к важным для работы сервисам. Чтобы начать обновление, просто нажмите кнопку установки.
sv: Ett system med de senaste uppdateringarna krävs för att IT ska kunna säkerställa att din dator är skyddad. Om du inte uppdaterar systemet kommer du kanske inte kunna komma åt nödvändinga resurser. För att påbörja uppdateringen, klicka på Uppdatera och följ stegen.
zh: 更新至最新的软件以确保 IT 可以精准的保护设备安全。 如未及时完成更新，您将会无法访问日常工作所需的网页或程序。 立刻更新，请点击【更新设备】并根据提供的步骤完成更新。

source: Your device requires a security update
da: Din Mac mangler en sikkerhedsopdatering
de: Ihr Gerät benötigt ein Sicherheitsupdate
fr: Votre appareil nécessite une mise à jour de sécurité.
ja: あなたのデバイスは更新が必要です
ko: 귀하의 기기에 보안 업데이트가 필요합니다
ru: Требуется обновление безопасности macOS
sv: En säkerhetsuppdatering behövs på din dator
zh: 您的设备需要安全更新

source: Your device requires a security update (Demo Mode)
da: Din Mac mangler en sikkerhedsopdatering (Demo tilstand)
de: Ihr Gerät benötigt ein Sicherheitsupdate (Demo-Modus)
fr: Votre appareil nécessite une mise à jour de sécurité. (Mode de démonstration)
ja: あなたのデバイスはセキュリティの更新が必要です(デモモード)
ko: 귀하의 기기에 보안 업데이트가 필요합니다 (데모 모드)
ru: Требуется обновление безопасности macOS (демо-режим)
sv: En säkerhetsuppdatering behövs på din dator (demoläge)
zh: 您的设备需要安全更新（演示模式)

source: Later
da: Senere
de: Später
fr: Plus tard
ja: 後で
ko: 나중에
ru: Потом
sv: Senare
zh: 稍后

source: I understand
da: Det er forstået
de: Ich verstehe
fr: Je comprends
ja: わかりました
ko: 이해했습니다
ru: Я понимаю
sv: Jag förstår
zh: 我同意

source: A friendly reminder from your local IT team
da: En venligt ment påmindelse fra din lokale IT afdeling
de: Eine freundliche Erinnerung von Ihrem IT-Team
fr: Un rappel amical de votre équipe informatique
ja: ローカルITチームからのリマインドです
ko: 로컬 IT 팀에서 알려드립니다
ru: Напоминание от команды IT
sv: En påminnelse från IT
zh: IT团队的友好提醒

source: Defer
da: Udsæt
de: Verschieben
fr: Reporter
ja: 延期
ko: 나중으로 미루기
ru: Отложить
sv: Skjut upp
zh: 推迟

source: One Hour
da: En time
de: Eine Stunde
fr: Une heure
ja: 1時間
ko: 한 시간
ru: На час
sv: En timme
zh: 一小时

source: One Day
da: En dag
de: Ein Tag
fr: Un jour
ja: 1日
ko: 하루
ru: На день
sv: En dag
zh: 一天

source: Custom
da: Længere tid
de: Benutzerdefinierter Zeitraum
fr: Personnaliser
ja: カスタム
ko: 직접 설정
ru: Другое
sv: Välj tid
zh: 自定义
